{
    "Theano": {
        "url": "https://en.wikipedia.org/wiki/Theano",
        "summary": "In Greek mythology, Theano (; Ancient Greek: Θεανώ) may refer to the following personages:\n\nTheano, wife of Metapontus, king of Icaria. Metapontus demanded that she bear him children, or leave the kingdom. She presented the children of Melanippe to her husband, as if they were her own. Later Theano bore him two sons of her own and, wishing to leave the kingdom to her own children, sent them to kill Melanippe's. In the fight that ensued, her two sons were killed, and she committed suicide upon hearing the news.\nTheano, one of the Danaïdes, daughter of Danaus and Polyxo. She married (and murdered) Phantes, son of Aegyptus and Caliadne.\nTheano, a priestess of Athena in Troy during the Trojan War. She was a daughter of King Cisseus of Thrace and wife of Antenor, one of the Trojan elders.\nTheano or Theona, a character appearing in the Aeneid, the consort of Amycus."
    },
    "Algorithm": {
        "url": "https://en.wikipedia.org/wiki/Algorithm",
        "summary": "In mathematics and computer science, an algorithm ( ) is a finite sequence of rigorous instructions, typically used to solve a class of specific problems or to perform a computation. Algorithms are used as specifications for performing calculations and data processing. More advanced algorithms can use conditionals to divert the code execution through various routes (referred to as automated decision-making) and deduce valid inferences (referred to as automated reasoning), achieving automation eventually. Using human characteristics as descriptors of machines in metaphorical ways was already practiced by Alan Turing with terms such as \"memory\", \"search\" and \"stimulus\".In contrast, a heuristic is an approach to problem solving that may not be fully specified or may not guarantee correct or optimal results, especially in problem domains where there is no well-defined correct or optimal result.As an effective method, an algorithm can be expressed within a finite amount of space and time and in a well-defined formal language for calculating a function. Starting from an initial state and initial input (perhaps empty), the instructions describe a computation that, when executed, proceeds through a finite number of well-defined successive states, eventually producing \"output\" and terminating at a final ending state. The transition from one state to the next is not necessarily deterministic; some algorithms, known as randomized algorithms, incorporate random input."
    }
}