{
    "Recurrent neural network": {
        "url": "https://en.wikipedia.org/wiki/Recurrent_neural_network",
        "summary": "A recurrent neural network (RNN) is one of the two broad types of artificial neural network, characterized by direction of the flow of information between its layers. In contrast to the uni-directional feedforward neural network, it is a bi-directional artificial neural network, meaning that it allows the output from some nodes to affect subsequent input to the same nodes. Their ability to use internal state (memory) to process arbitrary sequences of inputs makes them applicable to tasks such as unsegmented, connected handwriting recognition or speech recognition. The term \"recurrent neural network\" is used to refer to the class of networks with an infinite impulse response, whereas \"convolutional neural network\" refers to the class of finite impulse response. Both classes of networks exhibit temporal dynamic behavior. A finite impulse recurrent network is a directed acyclic graph that can be unrolled and replaced with a strictly feedforward neural network, while an infinite impulse recurrent network is a directed cyclic graph that can not be unrolled.\nAdditional stored states and the storage under direct control by the network can be added to both infinite-impulse and finite-impulse networks. The storage can also be replaced by another network or graph if that incorporates time delays or has feedback loops. Such controlled states are referred to as gated state or gated memory, and are part of long short-term memory networks (LSTMs) and gated recurrent units. This is also called Feedforward Neural Network (FNN). Recurrent neural networks are theoretically Turing complete and can run arbitrary programs to process arbitrary sequences of inputs."
    },
    "Neural network": {
        "url": "https://en.wikipedia.org/wiki/Neural_network",
        "summary": "A neural network is a neural circuit of biological neurons, sometimes also called a biological neural network, or a network of artificial neurons or nodes in the case of an artificial neural network.Artificial neural networks are used for solving artificial intelligence (AI) problems; they model connections of biological neurons as weights between nodes. A positive weight reflects an excitatory connection, while negative values mean inhibitory connections. All inputs are modified by a weight and summed. This activity is referred to as a linear combination. Finally, an activation function controls the amplitude of the output. For example, an acceptable range of output is usually between 0 and 1, or it could be −1 and 1.\nThese artificial networks may be used for predictive modeling, adaptive control and applications where they can be trained via a dataset. Self-learning resulting from experience can occur within networks, which can derive conclusions from a complex and seemingly unrelated set of information."
    },
    "Graphics processing unit": {
        "url": "https://en.wikipedia.org/wiki/Graphics_processing_unit",
        "summary": "A graphics processing unit (GPU) is a specialized electronic circuit initially designed to accelerate computer graphics and image processing (either on a video card or embedded on motherboards, mobile phones, personal computers, workstations, and game consoles). After their initial design, GPUs were found to be useful for non-graphic calculations involving embarrassingly parallel problems due to their parallel structure. Other non-graphical uses include the training of neural networks and cryptocurrency mining.\n\n"
    },
    "Genealogy": {
        "url": "https://en.wikipedia.org/wiki/Genealogy",
        "summary": "Genealogy (from Ancient Greek  γενεαλογία (genealogía) 'the making of a pedigree') is the study of families, family history, and the tracing of their lineages. Genealogists use oral interviews, historical records, genetic analysis, and other records to obtain information about a family and to demonstrate kinship and pedigrees of its members. The results are often displayed in charts or written as narratives. The field of family history is broader than genealogy, and covers not just lineage but also family and community history and biography.The record of genealogical work may be presented as a \"genealogy\", a \"family history\", or a \"family tree\". In the narrow sense, a \"genealogy\" or a \"family tree\" traces the descendants of one person, whereas a \"family history\" traces the ancestors of one person, but the terms are often used interchangeably. A family history may include additional biographical information, family traditions, and the like.The pursuit of family history and origins tends to be shaped by several motives, including the desire to carve out a place for one's family in the larger historical picture, a sense of responsibility to preserve the past for future generations, and self-satisfaction in accurate storytelling. Genealogy research is also performed for scholarly or forensic purposes, or to trace legal next of kin to inherit under intestacy laws."
    },
    "Phylogenetics": {
        "url": "https://en.wikipedia.org/wiki/Phylogenetics",
        "summary": "In biology, phylogenetics () is the study of the evolutionary history and relationships among or within groups of organisms. These relationships are determined by phylogenetic inference methods that focus on observed heritable traits, such as DNA sequences, protein amino acid sequences, or morphology. The result of such an analysis is a phylogenetic tree—a diagram containing a hypothesis of relationships that reflects the evolutionary history of a group of organisms.The tips of a phylogenetic tree can be living taxa or fossils, and represent the \"end\" or the present time in an evolutionary lineage. A phylogenetic diagram can be rooted or unrooted. A rooted tree diagram indicates the hypothetical common ancestor of the tree. An unrooted tree diagram (a network) makes no assumption about the ancestral line, and does not show the origin or \"root\" of the taxa in question or the direction of inferred evolutionary transformations.In addition to their use for inferring phylogenetic patterns among taxa, phylogenetic analyses are often employed to represent relationships among genes or individual organisms. Such uses have become central to understanding biodiversity, evolution, ecology, and genomes.\nPhylogenetics is component of systematics that uses similarities and differences of the characteristics of species to interpret their evolutionary relationships and origins. Phylogenetics focuses on whether the characteristics of a species reinforce a phylogenetic inference that it diverged from the most recent common ancestor of a taxonomic group.In the field of cancer research, phylogenetics can be used to study the clonal evolution of tumors and molecular chronology, predicting and showing how cell populations vary throughout the progression of the disease and during treatment, using whole genome sequencing techniques. The evolutionary processes behind cancer progression are quite different from those in species and are important to phylogenetic inference; these differences manifest in at least four areas: the types of aberrations that occur, the rates of mutation, the intensity, and high heterogeneity - variability - of tumor cell subclones.Phylogenetics can also aid in drug design and discovery. Phylogenetics allows scientists to organize species and can show which species are likely to have inherited particular traits that are medically useful, such as producing biologically active compounds - those that have effects on the human body. For example, in drug discovery, venom-producing animals are particularly useful. Venoms from these animals produce several important drugs, e.g., ACE inhibitors and Prialt (Ziconotide). To find new venoms, scientists turn to phylogenetics to screen for closely related species that may have the same useful traits. The phylogenetic tree shows which species of fish have an origin of venom, and related fish they may contain the trait. Using this approach in studying venomous fish, biologists are able to identify the fish species that may be venomous. Biologist have used this approach in many species such as snakes and lizards.\nIn forensic science, phylogenetic tools are useful to assess DNA evidence for court cases. The simple phylogenetic tree of viruses A-E shows the relationships between viruses e.g., all viruses are descendants of Virus A.\nHIV forensics uses phylogenetic analysis to track the differences in HIV genes and determine the relatedness of two samples. Phylogenetic analysis has been used in criminal trials to exonerate or hold individuals. HIV forensics does have its limitations, i.e., it cannot be the sole proof of transmission between individuals and phylogenetic analysis which shows transmission relatedness does not indicate direction of transmission.\n\n"
    },
    "Teacher forcing": {
        "url": "https://en.wikipedia.org/wiki/Teacher_forcing",
        "summary": "Teacher forcing is an algorithm for training the weights of recurrent neural networks (RNNs). It involves feeding observed sequence values (i.e. ground-truth samples) back into the RNN after each step, thus forcing the RNN to stay close to the ground-truth sequence.The term \"teacher forcing\" can be motivated by comparing the RNN to a human student taking a multi-part exam where the answer to each part (for example a mathematical calculation) depends on the answer to the preceding part. In this analogy, rather than grading every answer in the end, with the risk that the student fails every single part even though they only made a mistake in the first one, a teacher records the score for each individual part and then tells the student the correct answer, to be used in the next part.The use of an external teacher signal is in contrast to real-time recurrent learning (RTRL). Teacher signals are known from oscillator networks. The promise is, that teacher forcing helps to reduce the training time.The term \"teacher forcing\" was introduced in 1989 by Ronald J. Williams and David Zipser, who reported that the technique was already being \"frequently used in dynamical supervised learning tasks\" around that time.A NeurIPS 2016 paper introduced the related method of \"professor forcing\"."
    },
    "Backpropagation through time": {
        "url": "https://en.wikipedia.org/wiki/Backpropagation_through_time",
        "summary": "Backpropagation through time (BPTT) is a gradient-based technique for training certain types of recurrent neural networks. It can be used to train Elman networks. The algorithm was independently derived by numerous researchers."
    },
    "Cross-entropy": {
        "url": "https://en.wikipedia.org/wiki/Cross-entropy",
        "summary": "In information theory, the cross-entropy between two probability distributions \n  \n    \n      \n        p\n      \n    \n    {\\displaystyle p}\n   and \n  \n    \n      \n        q\n      \n    \n    {\\displaystyle q}\n   over the same underlying set of events measures the average number of bits needed to identify an event drawn from the set if a coding scheme used for the set is optimized for an estimated probability distribution \n  \n    \n      \n        q\n      \n    \n    {\\displaystyle q}\n  , rather than the true distribution \n  \n    \n      \n        p\n      \n    \n    {\\displaystyle p}\n  ."
    },
    "Probability distribution": {
        "url": "https://en.wikipedia.org/wiki/Probability_distribution",
        "summary": "In probability theory and statistics, a probability distribution is the mathematical function that gives the probabilities of occurrence of different possible outcomes for an experiment. It is a mathematical description of a random phenomenon in terms of its sample space and the probabilities of events (subsets of the sample space).For instance, if X is used to denote the outcome of a coin toss (\"the experiment\"), then the probability distribution of X would take the value 0.5 (1 in 2 or 1/2) for X = heads, and 0.5 for X = tails (assuming that the coin is fair). More commonly, probability distributions are used to compare the relative occurrence of many different random values.\nProbability distributions can be defined in different ways and for discrete or for continuous variables. Distributions with special properties or for especially important applications are given specific names."
    },
    "Parametric equation": {
        "url": "https://en.wikipedia.org/wiki/Parametric_equation",
        "summary": "In mathematics, a parametric equation defines a group of quantities as functions of one or more independent variables called parameters. Parametric equations are commonly used to express the coordinates of the points that make up a geometric object such as a curve or surface, called a  parametric curve and parametric surface, respectively. In such cases, the equations are collectively called a parametric representation, or parametric system, or parameterization (alternatively spelled as parametrisation) of the object.For example, the equations\n\nform a parametric representation of the unit circle, where t is the parameter: A point (x, y) is on the unit circle if and only if there is a value of t such that these two equations generate that point. Sometimes the parametric equations for the individual scalar output variables are combined into a single parametric equation in vectors:\n\nParametric representations are generally nonunique (see the \"Examples in two dimensions\" section below), so the same quantities may be expressed by a number of different parameterizations.In addition to curves and surfaces, parametric equations can describe manifolds and algebraic varieties of higher dimension, with the number of parameters being equal to the dimension of the manifold or variety, and the number of equations being equal to the dimension of the space in which the manifold or variety is considered (for curves the dimension is one and one parameter is used,  for surfaces dimension two and two parameters, etc.).\nParametric equations are commonly used in kinematics, where the trajectory of an object is represented by equations depending on time as the parameter. Because of this application, a single parameter is often labeled t; however, parameters can represent other physical quantities (such as geometric variables) or can be selected arbitrarily for convenience. Parameterizations are non-unique; more than one set of parametric equations can specify the same curve."
    },
    "Conditional probability distribution": {
        "url": "https://en.wikipedia.org/wiki/Conditional_probability_distribution",
        "summary": "In probability theory and statistics, given two jointly distributed random variables \n  \n    \n      \n        X\n      \n    \n    {\\displaystyle X}\n   and \n  \n    \n      \n        Y\n      \n    \n    {\\displaystyle Y}\n  , the conditional probability distribution of \n  \n    \n      \n        Y\n      \n    \n    {\\displaystyle Y}\n   given \n  \n    \n      \n        X\n      \n    \n    {\\displaystyle X}\n   is the probability distribution of \n  \n    \n      \n        Y\n      \n    \n    {\\displaystyle Y}\n   when \n  \n    \n      \n        X\n      \n    \n    {\\displaystyle X}\n   is known to be a particular value; in some cases the conditional probabilities may be expressed as functions containing the unspecified value \n  \n    \n      \n        x\n      \n    \n    {\\displaystyle x}\n   of \n  \n    \n      \n        X\n      \n    \n    {\\displaystyle X}\n   as a parameter. When both \n  \n    \n      \n        X\n      \n    \n    {\\displaystyle X}\n   and \n  \n    \n      \n        Y\n      \n    \n    {\\displaystyle Y}\n   are categorical variables, a conditional probability table is typically used to represent the conditional probability. The conditional distribution contrasts with the marginal distribution of a random variable, which is its distribution without reference to the value of the other variable.\nIf the conditional distribution of \n  \n    \n      \n        Y\n      \n    \n    {\\displaystyle Y}\n   given \n  \n    \n      \n        X\n      \n    \n    {\\displaystyle X}\n   is a continuous distribution, then its probability density function is known as the conditional density function. The properties of a conditional distribution, such as the moments, are often referred to by corresponding names such as the conditional mean and conditional variance.\nMore generally, one can refer to the conditional distribution of a subset of a set of more than two variables; this conditional distribution is contingent on the values of all the remaining variables, and if more than one variable is included in the subset then this conditional distribution is the conditional joint distribution of the included variables."
    },
    "Determinism": {
        "url": "https://en.wikipedia.org/wiki/Determinism",
        "summary": "Determinism is the philosophical view that events are completely determined by previously existing causes. Deterministic theories throughout the history of philosophy have developed from diverse and sometimes overlapping motives and considerations. Like eternalism, determinism focuses on particular events rather than the future as a concept. The opposite of determinism is indeterminism, or the view that events are not deterministically caused but rather occur due to chance. Determinism is often contrasted with free will, although some philosophers claim that the two are compatible. Historically, debates about determinism have involved many philosophical positions and given rise to multiple varieties or interpretations of determinism. One topic of debate concerns the scope of determined systems. Some philosophers have maintained that the entire universe is a single determinate system, while others identify more limited determinate systems. Another common debate topic is whether determinism and free will can coexist; compatibilism and incompatibilism represent the opposing sides of this debate.\nDeterminism should not be confused with the self-determination of human actions by reasons, motives, and desires. Determinism is about interactions which affect cognitive processes in people's lives. It is about the cause and the result of what people have done. Cause and result are always bound together in cognitive processes. It assumes that if an observer has sufficient information about an object or human being, that such an observer might be able to predict every consequent move of that object or human being. Determinism rarely requires that perfect prediction be practically possible."
    },
    "9": {
        "url": "https://en.wikipedia.org/wiki/9",
        "summary": "9 (nine) is the natural number following 8 and preceding 10."
    },
    "10": {
        "url": "https://en.wikipedia.org/wiki/10",
        "summary": "10 (ten) is the even natural number following 9 and preceding 11. Ten is the base of the decimal numeral system, the most common system of denoting numbers in both spoken and written language."
    },
    "Ketamine": {
        "url": "https://en.wikipedia.org/wiki/Ketamine",
        "summary": "Ketamine is a dissociative anesthetic used medically for induction and maintenance of anesthesia. It is also used as a treatment for depression, a pain management tool, and as a recreational drug. Ketamine is a novel compound that was derived from phencyclidine in 1962 in pursuit of a safer anesthetic with fewer hallucinogenic effects.At anesthetic doses, ketamine induces a state of dissociative anesthesia, a trance-like state providing pain relief, sedation, and amnesia. The distinguishing features of ketamine as anesthesia are preserved breathing and airway reflexes, stimulated heart function with increased blood pressure, and moderate bronchodilation. At lower, sub-anesthetic doses, ketamine is a promising agent for pain and treatment-resistant depression. As with many antidepressants, the results of a single administration of ketamine wane with time. The long-term effects of repeated use are largely unknown, and are an area of active investigation.Liver and urinary toxicity have been reported among regular users of high doses of ketamine for recreational purposes. Ketamine is an NMDA receptor pore blocker, accounting for most of its actions, but not the antidepressant effect, the mechanism of which is a matter of research and debate.Ketamine was first synthesized in 1962 and approved for use in the United States in 1970. It has been regularly used in veterinary medicine and was extensively used for surgical anesthesia in the Vietnam War. Along with other psychotropic drugs, it is on the World Health Organization's List of Essential Medicines. It is available as a generic medication. When used as a recreational drug, it is found both in powder and liquid form, and is often referred to as \"Special K\" for its hallucinogenic and dissociative effects."
    },
    "Eigenvalues and eigenvectors": {
        "url": "https://en.wikipedia.org/wiki/Eigenvalues_and_eigenvectors",
        "summary": "In linear algebra, it is often important to know which vectors have their directions unchanged by a linear transformation.  An eigenvector () or characteristic vector is such a vector.  Thus an eigenvector \n  \n    \n      \n        \n          v\n        \n      \n    \n    {\\displaystyle \\mathbf {v} }\n   of a linear transformation \n  \n    \n      \n        T\n      \n    \n    {\\displaystyle T}\n   is scaled by a constant factor \n  \n    \n      \n        λ\n      \n    \n    {\\displaystyle \\lambda }\n   when the linear transformation is applied to it: \n  \n    \n      \n        T\n        \n          v\n        \n        =\n        λ\n        \n          v\n        \n      \n    \n    {\\displaystyle T\\mathbf {v} =\\lambda \\mathbf {v} }\n  .  The corresponding eigenvalue, characteristic value, or characteristic root is the multiplying factor \n  \n    \n      \n        λ\n      \n    \n    {\\displaystyle \\lambda }\n  .\nGeometrically, vectors are multi-dimensional quantities with magnitude and direction, often pictured as arrows. A linear transformation rotates, stretches, or shears the vectors it acts upon. Its eigenvectors are those vectors that are only stretched, with no rotation or shear. The corresponding eigenvalue is the factor by which an eigenvector is stretched or squished. If the eigenvalue is negative, the eigenvector's direction is reversed.The eigenvectors and eigenvalues of a transformation serve to characterize it, and so they play important roles in all the areas where linear algebra is applied, from geology to quantum mechanics. In particular, it is often the case that a system is represented by a linear transformation whose outputs are fed as inputs to the same inputs (feedback).  In such an application, the largest eigenvalue is of particular importance, because it governs the long-term behavior of the system, after many applications of the linear transformation, and the associated eigenvector is the steady state of the system.\n\n"
    },
    "Complex number": {
        "url": "https://en.wikipedia.org/wiki/Complex_number",
        "summary": "In mathematics, a complex number is an element of a number system that extends the real numbers with a specific element denoted i, called the imaginary unit and satisfying the equation \n  \n    \n      \n        \n          i\n          \n            2\n          \n        \n        =\n        −\n        1\n      \n    \n    {\\displaystyle i^{2}=-1}\n  ; every complex number can be expressed in the form \n  \n    \n      \n        a\n        +\n        b\n        i\n      \n    \n    {\\displaystyle a+bi}\n  , where a and b are real numbers. Because no real number satisfies the above equation, i was called an imaginary number by René Descartes. For the complex number \n  \n    \n      \n        a\n        +\n        b\n        i\n      \n    \n    {\\displaystyle a+bi}\n  , a is called the real part, and b is called the imaginary part. The set of complex numbers is denoted by either of the symbols \n  \n    \n      \n        \n          C\n        \n      \n    \n    {\\displaystyle \\mathbb {C} }\n   or C. Despite the historical nomenclature \"imaginary\", complex numbers are regarded in the mathematical sciences as just as \"real\" as the real numbers and are fundamental in many aspects of the scientific description of the natural world.Complex numbers allow solutions to all polynomial equations, even those that have no solutions in real numbers. More precisely, the fundamental theorem of algebra asserts that every non-constant polynomial equation with real or complex coefficients has a solution which is a complex number. For example, the equation\n\n  \n    \n      \n        (\n        x\n        +\n        1\n        \n          )\n          \n            2\n          \n        \n        =\n        −\n        9\n      \n    \n    {\\displaystyle (x+1)^{2}=-9}\n  \nhas no real solution, since the square of a real number cannot be negative, but has the two nonreal complex solutions \n  \n    \n      \n        −\n        1\n        +\n        3\n        i\n      \n    \n    {\\displaystyle -1+3i}\n   and \n  \n    \n      \n        −\n        1\n        −\n        3\n        i\n      \n    \n    {\\displaystyle -1-3i}\n  .\nAddition, subtraction and multiplication of complex numbers can be naturally defined by using the rule \n  \n    \n      \n        \n          i\n          \n            2\n          \n        \n        =\n        −\n        1\n      \n    \n    {\\displaystyle i^{2}=-1}\n   combined with the associative, commutative, and distributive laws. Every nonzero complex number has a multiplicative inverse. This makes the complex numbers a field that has the real numbers as a subfield. The complex numbers also form a real vector space of dimension two, with {1, i} as a standard basis.\nThis standard basis makes the complex numbers a Cartesian plane, called the complex plane. This allows a geometric interpretation of the complex numbers and their operations, and conversely expressing in terms of complex numbers some geometric properties and constructions. For example, the real numbers form the real line which is identified to the horizontal axis of the complex plane. The complex numbers of absolute value one form the unit circle. The addition of a complex number is a translation in the complex plane, and the multiplication by a complex number is a similarity centered at the origin. The complex conjugation is the reflection symmetry with respect to the real axis. The complex absolute value is a Euclidean norm.\nIn summary, the complex numbers form a rich structure that is simultaneously an algebraically closed field, a commutative algebra over the reals, and a Euclidean vector space of dimension two."
    },
    "Deep learning": {
        "url": "https://en.wikipedia.org/wiki/Deep_learning",
        "summary": "Deep learning is the subset of machine learning methods which are based on artificial neural networks with representation learning. The adjective \"deep\" in deep learning refers to the use of multiple layers in the network. Methods used can be either supervised, semi-supervised or unsupervised.Deep-learning architectures such as deep neural networks, deep belief networks, deep reinforcement learning, recurrent neural networks, convolutional neural networks and transformers have been applied to fields including computer vision, speech recognition, natural language processing, machine translation, bioinformatics, drug design, medical image analysis, climate science, material inspection and board game programs, where they have produced results comparable to and in some cases surpassing human expert performance.Artificial neural networks (ANNs) were inspired by information processing and distributed communication nodes in biological systems. ANNs have various differences from biological brains. Specifically, artificial neural networks tend to be static and symbolic, while the biological brain of most living organisms is dynamic (plastic) and analog."
    }
}